In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name" : ['Radhakant','rakesh','suman','patra'],
    "marks" :[92,34,24,89],
    "city" : ['keonjhar','nayagard','jajpur','kendrapada']
}

In [3]:
df = pd.DataFrame(dict1)
# DataFrame is like a excel sheet, which converts the whole
# data for faster indexing and also numpy all function will work here.

# DataFrame to CSV

In [4]:
df
# 0123 is called index and name marks city are called column

        name  marks        city
0  Radhakant     92    keonjhar
1     rakesh     34    nayagard
2      suman     24      jajpur
3      patra     89  kendrapada

In [5]:
df.to_csv('friends.csv')
# to_csv is a function which will export all data to csv format.

In [6]:
df.to_csv('friends_index_false.csv', index=False)
# if index=False then it will omit the index part.

In [7]:
df.head(2)
# it will show first 2 rows data

        name  marks      city
0  Radhakant     92  keonjhar
1     rakesh     34  nayagard

In [8]:
df.tail(2)
# it will show last 2 rows data

    name  marks        city
2  suman     24      jajpur
3  patra     89  kendrapada

In [9]:
df.describe()

           marks
count   4.000000
mean   59.750000
std    35.761944
min    24.000000
25%    31.500000
50%    61.500000
75%    89.750000
max    92.000000

# read csv

In [10]:
train = pd.read_csv('friends.csv')

In [11]:
train

   Unnamed: 0       name  marks        city
0           0  Radhakant     92    keonjhar
1           1     rakesh     34    nayagard
2           2      suman     24      jajpur
3           3      patra     89  kendrapada

In [12]:
train['marks']

0    92
1    34
2    24
3    89
Name: marks, dtype: int64

In [13]:
train['marks'][0]

92

In [14]:
train['marks'][0] =50

<ipython-input-14-9730f545215d>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['marks'][0] =50

In [15]:
train

   Unnamed: 0       name  marks        city
0           0  Radhakant     50    keonjhar
1           1     rakesh     34    nayagard
2           2      suman     24      jajpur
3           3      patra     89  kendrapada

In [16]:
train.to_csv('friends.csv')
# saving modified csv

In [17]:
# changing index
train.index = ['first','second','third','fourth']

In [18]:
train

        Unnamed: 0       name  marks        city
first            0  Radhakant     50    keonjhar
second           1     rakesh     34    nayagard
third            2      suman     24      jajpur
fourth           3      patra     89  kendrapada

# DataFrame vs Series
#### DataFrame creates in the combination of Series

In [19]:
# series(single row or column value of a DataFrame)
x =train['name']
type(x)

pandas.core.series.Series

In [20]:
# dataframe
type(train)

pandas.core.frame.DataFrame

In [21]:
ser = pd.Series(np.random.rand(34))

In [22]:
ser.head()

0    0.183230
1    0.632610
2    0.336689
3    0.227356
4    0.497334
dtype: float64

In [23]:
type(ser)

pandas.core.series.Series

In [24]:
# DataFrame
newdf = pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [25]:
#newdf
newdf.head()

          0         1         2         3         4
0  0.801871  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4  0.598960  0.300733  0.499311  0.867183  0.889457

In [26]:
type(newdf)

pandas.core.frame.DataFrame

In [27]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.506767    0.501111    0.511791    0.498454    0.502089
std      0.298000    0.275252    0.290281    0.300417    0.285925
min      0.000866    0.000622    0.002188    0.003893    0.001392
25%      0.248698    0.289216    0.256049    0.239434    0.248460
50%      0.481864    0.512057    0.542685    0.493825    0.522731
75%      0.778366    0.711878    0.767283    0.768754    0.752194
max      0.996157    0.991804    0.999180    0.999047    0.998835

In [28]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [29]:
newdf.head()

          0         1         2         3         4
0  0.801871  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4  0.598960  0.300733  0.499311  0.867183  0.889457

In [30]:
# in head command all the columns value is float64 
# if i change any one value to string then dtypes converts to object.
newdf[0][0] = 'raja'

In [31]:
#newdf.head()
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [32]:
# only index
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [33]:
#only columns
newdf.columns

RangeIndex(start=0, stop=5, step=1)

# DataFrame to numpy array

In [34]:
# converts to numpy array
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0        raja  0.451231  0.391120  0.075522  0.318420
1    0.556813  0.030761  0.314216  0.265978  0.439652
2    0.455705  0.677092  0.827952  0.149986  0.771090
3    0.165096  0.874907  0.583527  0.874514  0.490397
4     0.59896  0.300733  0.499311  0.867183  0.889457
..        ...       ...       ...       ...       ...
329  0.835892  0.447677  0.099733  0.486905  0.347216
330  0.743749  0.907729  0.998722  0.039744  0.223168
331  0.127311  0.017400  0.546463  0.554705  0.280179
332  0.624908  0.000622  0.008991  0.020568  0.790809
333  0.318989  0.583389  0.820445  0.952252  0.998835

[334 rows x 5 columns]>

# Transpose DataFrame

In [35]:
# Transpose the Dataframe
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,raja,0.556813,0.455705,0.165096,0.59896,0.266508,0.986004,0.680323,0.571986,0.408698,...,0.471636,0.134936,0.714804,0.69167,0.662319,0.835892,0.743749,0.127311,0.624908,0.318989
1,0.451231,0.030761,0.677092,0.874907,0.300733,0.652473,0.47471,0.165583,0.406086,0.90323,...,0.199945,0.429493,0.7119,0.42696,0.725243,0.447677,0.907729,0.0174,0.000622,0.583389
2,0.39112,0.314216,0.827952,0.583527,0.499311,0.91267,0.122566,0.488817,0.812661,0.335716,...,0.786393,0.7399,0.223966,0.802541,0.670484,0.099733,0.998722,0.546463,0.008991,0.820445
3,0.075522,0.265978,0.149986,0.874514,0.867183,0.788568,0.527463,0.052102,0.999047,0.62739,...,0.52451,0.596198,0.239293,0.905428,0.830192,0.486905,0.039744,0.554705,0.020568,0.952252
4,0.31842,0.439652,0.77109,0.490397,0.889457,0.613966,0.610269,0.724182,0.436908,0.803033,...,0.782666,0.386273,0.877428,0.582861,0.24735,0.347216,0.223168,0.280179,0.790809,0.998835

In [36]:
type(newdf.T)

pandas.core.frame.DataFrame

In [37]:
newdf.info

<bound method DataFrame.info of             0         1         2         3         4
0        raja  0.451231  0.391120  0.075522  0.318420
1    0.556813  0.030761  0.314216  0.265978  0.439652
2    0.455705  0.677092  0.827952  0.149986  0.771090
3    0.165096  0.874907  0.583527  0.874514  0.490397
4     0.59896  0.300733  0.499311  0.867183  0.889457
..        ...       ...       ...       ...       ...
329  0.835892  0.447677  0.099733  0.486905  0.347216
330  0.743749  0.907729  0.998722  0.039744  0.223168
331  0.127311  0.017400  0.546463  0.554705  0.280179
332  0.624908  0.000622  0.008991  0.020568  0.790809
333  0.318989  0.583389  0.820445  0.952252  0.998835

[334 rows x 5 columns]>

# sorting

In [38]:
# sorting index
newdf.head()

          0         1         2         3         4
0      raja  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457

In [39]:
#row sorting
newdf.sort_index(axis=0,ascending=False)
#bydefault ascending is True

            0         1         2         3         4
333  0.318989  0.583389  0.820445  0.952252  0.998835
332  0.624908  0.000622  0.008991  0.020568  0.790809
331  0.127311  0.017400  0.546463  0.554705  0.280179
330  0.743749  0.907729  0.998722  0.039744  0.223168
329  0.835892  0.447677  0.099733  0.486905  0.347216
..        ...       ...       ...       ...       ...
4     0.59896  0.300733  0.499311  0.867183  0.889457
3    0.165096  0.874907  0.583527  0.874514  0.490397
2    0.455705  0.677092  0.827952  0.149986  0.771090
1    0.556813  0.030761  0.314216  0.265978  0.439652
0        raja  0.451231  0.391120  0.075522  0.318420

[334 rows x 5 columns]

In [40]:
#column sorting
newdf.sort_index(axis=1,ascending = False)

            4         3         2         1         0
0    0.318420  0.075522  0.391120  0.451231      raja
1    0.439652  0.265978  0.314216  0.030761  0.556813
2    0.771090  0.149986  0.827952  0.677092  0.455705
3    0.490397  0.874514  0.583527  0.874907  0.165096
4    0.889457  0.867183  0.499311  0.300733   0.59896
..        ...       ...       ...       ...       ...
329  0.347216  0.486905  0.099733  0.447677  0.835892
330  0.223168  0.039744  0.998722  0.907729  0.743749
331  0.280179  0.554705  0.546463  0.017400  0.127311
332  0.790809  0.020568  0.008991  0.000622  0.624908
333  0.998835  0.952252  0.820445  0.583389  0.318989

[334 rows x 5 columns]

In [41]:
type(newdf[0])
# in the combination of series Dataframe create

pandas.core.series.Series

# copy vs view

In [42]:
# view
newdf2 = newdf
# newdf2 is a view(reference) of newdf
# if we change anything on newdf2 then newdf will be change.

In [43]:
newdf.head()

          0         1         2         3         4
0      raja  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457

In [44]:
newdf2[0][0] = 'suman'

<ipython-input-44-b060a01d9065>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0] = 'suman'

In [45]:
newdf.head()
# raja change to suman

          0         1         2         3         4
0     suman  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457

In [46]:
# copy
newdf3 = newdf.copy()
# it will create a copy of newdf on another location.
# if we change newdf3 then newdf will not be change.

In [47]:
newdf3[0][0] = 'Suman'
# this warning is not  error
# bcz pandas decide how to show the data as viw or copy 
# so for avoiding this warning we use loc attribute

<ipython-input-47-22b9ca32e19e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0] = 'Suman'

In [48]:
newdf3.head()

          0         1         2         3         4
0     Suman  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457

In [49]:
newdf.head()
# newdf3[0][0] is Suman and newdf[0][0] is Raja so 
# both are present on different location

          0         1         2         3         4
0     suman  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457

In [50]:
# changing columns
newdf.columns = list('ABCDE')

In [51]:
newdf.head(2)

          A         B         C         D         E
0     suman  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652

# LOC

In [52]:
newdf.loc[0,'A']

'suman'

In [53]:
# if i create accidentaly create like this
newdf.loc[0,0] = 'Raja'

In [54]:
newdf.head()
# one extra clolumn will be create if it's not available

          A         B         C         D         E     0
0     suman  0.451231  0.391120  0.075522  0.318420  Raja
1  0.556813  0.030761  0.314216  0.265978  0.439652   NaN
2  0.455705  0.677092  0.827952  0.149986  0.771090   NaN
3  0.165096  0.874907  0.583527  0.874514  0.490397   NaN
4   0.59896  0.300733  0.499311  0.867183  0.889457   NaN

In [55]:
# want to remove the unnecessary column like this
newdf = newdf.drop(0,axis=1)

# changing data with loc

In [56]:
newdf.loc[0,'A'] = 654
# 0 --> row
# 'A' --> column

In [57]:
newdf.head()

          A         B         C         D         E
0       654  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457

# only specific data returns with loc

In [58]:
newdf.loc[[1,2],['C','D']]
# it is not changing the original dataframe
# it's only giving me the copy of result

          C         D
1  0.314216  0.265978
2  0.827952  0.149986

In [59]:
newdf.head().loc[:,['B','D']]
# it's give me all the rows with B and D columns.

          B         D
0  0.451231  0.075522
1  0.030761  0.265978
2  0.677092  0.149986
3  0.874907  0.874514
4  0.300733  0.867183

In [60]:
newdf.loc[1:5,:]
# it's give me the all columns value with row from 1 to 4

          A         B         C         D         E
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457
5  0.266508  0.652473  0.912670  0.788568  0.613966

# running complex query inside Loc

In [61]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.9)]

            A         B         C         D         E
5    0.266508  0.652473  0.912670  0.788568  0.613966
45   0.201961  0.274433  0.957179  0.881322  0.232967
83   0.138096  0.974898  0.913798  0.752349  0.780268
90   0.114744  0.531995  0.945337  0.614940  0.640034
127  0.128261  0.631223  0.945028  0.712114  0.993352
144  0.060451  0.783803  0.944397  0.632672  0.832245
171  0.122907  0.548406  0.999180  0.852878  0.983109
219  0.245918  0.554145  0.973894  0.469147  0.313081

# -------------------------------------------

# iloc 
### if we don't wnat to find element through column name or row name then we should use iloc

In [62]:
newdf.head(2)

          A         B         C         D         E
0       654  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652

In [63]:
newdf.iloc[0,4]
# 0--> row place 0th element
# 4 --> column place 4th element(E)
# 0.19238612658525533

0.3184202186123638

In [64]:
newdf.iloc[[0,5],[1,2]]
# [0,5] -- for row place 0th and 5th element(0,1)
# [1,2] -- for column place 1st and 2nd element(B,C)

          B        C
0  0.451231  0.39112
5  0.652473  0.91267

# Drop a row data

In [65]:
newdf.head(3)

          A         B         C         D         E
0       654  0.451231  0.391120  0.075522  0.318420
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090

In [66]:
newdf.head().drop([0])
# row 0 deleted

          A         B         C         D         E
1  0.556813  0.030761  0.314216  0.265978  0.439652
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457

# Drop a column

In [67]:
newdf.head().drop(['A','D'],axis = 1)
# column 'A' deleted
# it will not be reflect on newdf bcz it's only a copy of it.
# if we really want to change the newdf data then we should write in this way
# newdf = newdf.head().drop(['A','D'],axis = 1)

# there is also a way to doing it .
# it will delete permanently from the original newdf dataFrame
# newdf.drop(['A','D'],axis = 1, inplace = True)

          B         C         E
0  0.451231  0.391120  0.318420
1  0.030761  0.314216  0.439652
2  0.677092  0.827952  0.771090
3  0.874907  0.583527  0.490397
4  0.300733  0.499311  0.889457

In [68]:
newdf.drop([1,5],axis=0,inplace=True)

In [69]:
newdf.head()
# 1 and 5th row deleted

          A         B         C         D         E
0       654  0.451231  0.391120  0.075522  0.318420
2  0.455705  0.677092  0.827952  0.149986  0.771090
3  0.165096  0.874907  0.583527  0.874514  0.490397
4   0.59896  0.300733  0.499311  0.867183  0.889457
6  0.986004  0.474710  0.122566  0.527463  0.610269

# reset index

In [70]:
# if we want to convert upper DataFrame index to secquential format like 0,1.......
newdf.head().reset_index()
# it will reset index but also add a new Column named as index

   index         A         B         C         D         E
0      0       654  0.451231  0.391120  0.075522  0.318420
1      2  0.455705  0.677092  0.827952  0.149986  0.771090
2      3  0.165096  0.874907  0.583527  0.874514  0.490397
3      4   0.59896  0.300733  0.499311  0.867183  0.889457
4      6  0.986004  0.474710  0.122566  0.527463  0.610269

In [71]:
# we want to remove this column named as index
newdf.reset_index(drop=True,inplace=True)

In [72]:
newdf.head()
# our index reset successfully

          A         B         C         D         E
0       654  0.451231  0.391120  0.075522  0.318420
1  0.455705  0.677092  0.827952  0.149986  0.771090
2  0.165096  0.874907  0.583527  0.874514  0.490397
3   0.59896  0.300733  0.499311  0.867183  0.889457
4  0.986004  0.474710  0.122566  0.527463  0.610269

# checking null values

In [73]:
newdf.head()['B'].isnull()
# if value null it's giving True else False
# false means values are not null

0    False
1    False
2    False
3    False
4    False
Name: B, dtype: bool

# checking not null

In [99]:
newdf.head().notnull()
# if the value is not null then it's return True else False

      A      B     C     D     E
0  True  False  True  True  True
1  True  False  True  True  True
2  True  False  True  True  True
3  True  False  True  True  True
4  True  False  True  True  True

# convert all values to none

In [80]:
#newdf['B'] = None
# don't use this method instead use this
newdf.loc[:,['B']]= None
# all value of B column is None

In [81]:
newdf.head()

          A     B         C         D         E
0       654  None  0.391120  0.075522  0.318420
1  0.455705  None  0.827952  0.149986  0.771090
2  0.165096  None  0.583527  0.874514  0.490397
3   0.59896  None  0.499311  0.867183  0.889457
4  0.986004  None  0.122566  0.527463  0.610269

In [82]:
newdf.head().isnull()

       A     B      C      D      E
0  False  True  False  False  False
1  False  True  False  False  False
2  False  True  False  False  False
3  False  True  False  False  False
4  False  True  False  False  False

In [83]:
newdf.head()

          A     B         C         D         E
0       654  None  0.391120  0.075522  0.318420
1  0.455705  None  0.827952  0.149986  0.771090
2  0.165096  None  0.583527  0.874514  0.490397
3   0.59896  None  0.499311  0.867183  0.889457
4  0.986004  None  0.122566  0.527463  0.610269

# -----------------------------------------

In [84]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [85]:
df.head()

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

# Drop the rows where at least one element is missing

In [86]:
df.dropna()

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [88]:
df.shape

(3, 3)

In [89]:
df.info

<bound method DataFrame.info of        name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT>

In [ ]:
df.info()

In [95]:
#count  unique element
# after type value click tab and wait it notebook will prompt you the suggestion.
df['name'].value_counts(dropna = False)

Catwoman    1
Alfred      1
Batman      1
Name: name, dtype: int64

# Exercise

In [107]:
#### create a dataframe which contains only integer with 3 rows and 2 columns
#### run following dataframe methods on them

df1 = pd.DataFrame(np.random.randint(10,size=(3,2)),index=np.arange(3))

In [108]:
df1

   0  1
0  3  6
1  3  7
2  0  7

In [109]:
df1.describe()

              0         1
count  3.000000  3.000000
mean   2.000000  6.666667
std    1.732051  0.577350
min    0.000000  6.000000
25%    1.500000  6.500000
50%    3.000000  7.000000
75%    3.000000  7.000000
max    3.000000  7.000000

In [110]:
df1.mean()

0    2.000000
1    6.666667
dtype: float64

In [111]:
df1.corr()

     0    1
0  1.0 -0.5
1 -0.5  1.0

In [112]:
df1.count()

0    3
1    3
dtype: int64

In [113]:
df1.max()

0    3
1    7
dtype: int32

In [114]:
df1.min()

0    0
1    6
dtype: int32

In [116]:
df1.median()

0    3.0
1    7.0
dtype: float64

In [117]:
df1.std()

0    1.732051
1    0.577350
dtype: float64